; Пробел перед точкой с запятой обязателен!!! это разделитель перед комментарием
G10 X1.000 Y2.000 A0.000 ; Initial required start point and angle in robot's local coordinates

G4 P2000
G2 L1.0 F0.10  ; ЦВ в вершину

G4 P2000 ;  
G1 X3.0 Y3.00 F0.05 ;  
G4 P2000 ;  
G2 X3.0 Y3.00 F0.2; 

G4 P2000
G2 L0.5 F-0.10 ; Откат назад
G4 P2000

G4 P2000 ;  
G1 X1.0 Y3.00 F0.05 ;  
G4 P2000 ;  
G2 X1.0 Y3.00 F0.2; 


;G2 L0.5 F0.1
;M3 T1000
;G4 P1000 ;  
;M5 T1000
;G4 P1000 ;  
;G9 ; Зацикливание
;G2 X0.5 Y0.0 F0.1


;G1 O45.0 F0.05 ;  
;G4 P3000 ;  
;G1 O-90.0 F0.05 ;  
;G4 P1000 ;  
;G1 O45.0 F0.05 ;  
;G4 P3000 ;  

;G1 X1.0 Y1.00 F0.05;  
;G4 P2000 ;  
;G1 X1.0 Y-1.00 F0.05;  
;G4 P2000 ;  
;G1 X-1.0 Y-1.00 F0.05;  
;G4 P2000 ;  
;G1 X-1.0 Y1.00 F0.05;  
;G4 P2000 ;  
;G1 X1.0 Y0.00 F0.05;  
;G4 P2000 ;  
