; Пробел перед точкой с запятой обязателен!!! это разделитель перед комментарием
G10 X1.100 Y1.700 A0.000 ; Initial required start point and angle in robot's local coordinates

G4 P2000 ;  

G1 X1.600 Y1.700 F0.05 ;  
M3 T2000
G2 X1.600 Y1.700 F0.2; 
M5 T2000

G1 X1.600 Y1.800 F0.05 ;  
M3 T2000
G2 X1.600 Y1.800 F0.2; 
M5 T2000

G1 X1.100 Y1.800 F0.05 ;  
M3 T2000
G2 X1.100 Y1.800 F0.2; 
M5 T2000

G1 X1.0 Y1.000 F0.05 ;  
G4 P2000 ;
G2 X1.0 Y1.000 F0.2; 
G4 P2000 ;
G1 A0.000 F0.05


;G9 ; Зацикливание
