
G1 X1.0 Y0.0 F0.05   ; Поворот куда надо ехать
G4 P2000

M3 T1000 ; Опустили маркер

G2 X0.96 Y0.0 F0.10 ; Движение к следующе точке
M5 T2000 ; Подняли маркер

G2 L0.045 F0.10 ; Вперед 4 см. Маркер становиться в точку вращения Rotation Base
G4 P2000

G1 X1.0 Y1.0 F0.05   ; Поворот куда надо
G4 P2000

G2 L0.045 F-0.10 ; Откат назад 4 см. Маркер становиться в точку вращения Rotation Base
M3 T1000 ; Опустили маркер

G2 X1.0 Y1.0 F0.10
M5 T2000 ; Подняли маркер

G2 L0.045 F0.10 ; Вперед 4 см. Маркер становиться в точку вращения Rotation Base
G4 P2000

G1 X0.0 Y0.0 F0.05   ; Поворот куда надо
G4 P2000

G2 L0.045 F-0.10 ; Откат назад 4 см. Маркер становиться в точку вращения Rotation Base
M3 T1000 ; Опустили маркер

G2 X0.0 Y0.0 F0.10
M5 T2000 ; Подняли маркер

G2 L0.045 F0.10 ; Вперед 4 см. Маркер становиться в точку вращения Rotation Base
G4 P2000

G1 X0.0 Y1.0 F0.05   ; Поворот куда надо
G4 P2000
